#二项分布，概率。参数1：成功x次 参数二:一共多少次试验。 参数三:成功的概率
dbinom(0,5,0.06)
dbinom(1,5,0.06)

#正态分布,mean均值,sd方差,40为在40处的累计概率X<=40
pnorm(40,mean=50,sd=10)
pnorm(40,mean = 50,sd=10)-pnorm(30,mean = 50,sd=10)              #P(30<=X<=40)

#正态分布的分位数. 
qnorm(0.025,mean = 0,sd=1)  #累计概率为0.025时的反函数Z值

########################################################################
#计算卡方分布的概率
pchisq(10,df=15)          #自由度为15,卡方值小于10的概率
1-pchisq(15,df=25)        #自由度为25,卡方值大于15的概率

#计算卡方分布的分位数
qchisq(0.95,df=10)        #卡方分布右尾概率为0.05时的反函数值


########################################################################
#t分布
pt(-2,df=10)              #自由度为10,t值小于-2的概率

1-pt(3,df=15)             #自由度为15，t值大于3的概率

#t的分位数
qt(0.975,df=25)           #自由度为25，t分布右尾概率为0.025时的t值


########################################################################
#F分布
pf(3,df1=10,df2=8)             #分子自由度为10,分母自由度为8,F值小于3的概率

#F分布分位数
qf(0.95,df1=25,df2=20)         #分子自由度为25，分母自由度为20,分布累计概率为0.95时的F值

